SimpleUpdate.org
** Util
#+BEGIN_SRC jupyter-julia :tangle src/util.jl :eval no :hidden
module Util
using ..OptimalContraction: ContractionCache, optimal_contraction_inds
export ncon_indices,
    moveind!,
    padded_inner_product,
    Logger,
    record!,
    tile_structurematrix,
    tile_structurematrix_with_origin,
    make_ordered_structurematrix,
    connection_matrix_from_connections
#+END_SRC
#+BEGIN_SRC jupyter-julia :tangle src/util.jl :eval no :hidden
using LinearAlgebra: norm
"""
    ncon_indices(sizes, contractions, open_inds; optimize=false)
Calculate the ncon style indices for a series of indice contractions and open indices

sizes: A Vector of tuples representing the sizes of the contracted tensors

contractions: A Vector of `((tensor_num_A, ind_A), (tensor_num_B, ind_B))`

open_inds: A Vector deciding the order of open indices. Written as e.g.

`[(tensor_num_A, (1,2,3)), (tensor_num_B, (1,2,3)), (tensor_num_A, (4,)), (tensor_num_B, (4,))]`
"""
function ncon_indices(sizes, contractions, open_inds, optimize=false)
    inds = _ncon_indices(sizes, contractions, open_inds)
    if optimize
        return optimal_contraction_inds(sizes, inds)
    else
        return inds
    end
end

function ncon_indices(sizes, contractions, open_inds, cache::ContractionCache)
    inds = _ncon_indices(sizes, contractions, open_inds)
    return optimal_contraction_inds(sizes, inds; cache=cache)
end

function _ncon_indices(sizes::Vector{<:Tuple}, contractions, open_inds)
    dims = length.(sizes)
    inds = [zeros(Int, dim) for dim in dims]
    closed = 0
    for ((A, Aind), (B, Bind)) in contractions
        inds[A][Aind] = inds[B][Bind] = closed += 1
    end
    open = 0
    for (A, oinds) in open_inds
        for i in oinds
            inds[A][i] = open -= 1
        end
    end
    return Tuple(inds)
end

function moveind!(a, from, to)
    val = popat!(a, from)
    insert!(a, to, val)
    a
end

struct Logger{LogStep}
    logf::Any
    log::Vector{LogStep}
end

Logger{LogStep}(; printit::Int=0) where {LogStep} =
    Logger{LogStep}(LogStep[]) do logv, step
        if length(logv) % printit == 0
            println(step)
        end
    end

function record!(logger::Logger{LogStep}, step::LogStep) where {LogStep}
    logger.logf(logger.log, step)
    push!(logger.log, step)
end

record!(logger::Logger{LogStep}, t::Tuple) where {LogStep<:NamedTuple} =
    record!(logger, LogStep(t))

pad(a::AbstractVector, n, f) = [a; fill(f, n - length(a))]

"""
    padded_inner_product(a, b)
Calculate the inner product of two vectors, that can be of different lengths.
If one vector is longer the other is padded with zeros for the calculation of
the inner product.
"""
function padded_inner_product(a::V, b::V) where {T,V<:AbstractVector{T}}
    max_length = max(length(a), length(b))
    norm(pad(a, max_length, zero(T)) .- pad(b, max_length, zero(T)))
end


function tile_structurematrix_with_origin(m, tile_pattern)
    N = maximum(tile_pattern) # number of distinct unit cells
    D = ndims(tile_pattern) # number of tile directions
    n = Int(size(m)[1] / (2^D)) # number of sites in unit cell
    nS = size(m)[2] # Number of Simplices connected to primitive unit cell
    parts = Matrix{Tuple{Int,CartesianIndex{D}}}[]
    cinds = CartesianIndices(Tuple(2 for _ = 1:D))
    for ci in CartesianIndices(tile_pattern)
        cells_inds = mod_ind.(cartesian_positive_adjacents(ci), Ref(size(tile_pattern)))
        tocells = tile_pattern[cells_inds]

        m_struct = fill((0, zero(CartesianIndex{D})), (N * n, nS))
        for (fromcell, tocell) in enumerate(tocells)
            for (row_to, row_from) in
                zip(((tocell-1)*n+1):tocell*n, ((fromcell-1)*n+1):fromcell*n)
                for col = 1:nS
                    celli = fld_ind(row_from, n)
                    if m[row_from, col] != 0
                        m_struct[row_to, col] = (m[row_from, col], cinds[celli])
                    end
                end
            end
        end
        push!(parts, m_struct)
    end
    reduce(hcat, unique(parts))
end

function tile_structurematrix(m, tile_pattern)
    N = maximum(tile_pattern) # number of distinct unit cells
    D = ndims(tile_pattern) # number of tile directions
    n = Int(size(m)[1] / (2^D)) # number of sites in unit cell
    nS = size(m)[2] # Number of Simplices connected to primitive unit cell
    parts = Matrix{Int}[]
    for ci in CartesianIndices(tile_pattern)
        cells_inds = mod_ind.(cartesian_positive_adjacents(ci), Ref(size(tile_pattern)))
        tocells = tile_pattern[cells_inds]

        m_struct = zeros(Int, (N * n, nS))
        for (fromcell, tocell) in enumerate(tocells)
            m_struct[((tocell-1)*n+1):tocell*n, :] .+= m[((fromcell-1)*n+1):fromcell*n, :]
        end
        push!(parts, m_struct)
    end
    reduce(hcat, unique(parts))
end

fld_ind(i, l) = fld((i - 1), l) + 1
mod_ind(i, l) = (i - 1) % l + 1
mod_ind(c::CartesianIndex, s) = CartesianIndex(mod_ind.(c.I, s))

function cartesian_positive_adjacents(ci::CartesianIndex{D}) where {D}
    offsets = CartesianIndices(ntuple(_ -> D, Val(D))) .- Ref(one(CartesianIndex{D}))
    return offsets .+ Ref(ci)
end


function make_ordered_structurematrix(m0)
    m = copy(m0)
    D = Dict{Int,Int}()
    for (Si, Scol) in enumerate(eachcol(m))
        for si in findall(x -> x != 0, Scol)
            n = get(D, si, 0) + 1
            m[si, Si] = D[si] = n
        end
    end
    m
end

function connection_matrix_from_connections(
    connections,
    n_cells=maximum([getindex.(c, 2) for c in connections] |> Iterators.flatten),
)
    n_sites = maximum([getindex.(c, 1) for c in connections] |> Iterators.flatten)
    m = zeros(Int, (n_sites * n_cells, length(connections)))
    for (i, sites) in enumerate(connections)
        for site in sites
            m[(site[2]-1)*n_sites+site[1], i] = site[3]
        end
    end
    m
end
#+END_SRC
#+BEGIN_SRC jupyter-julia :tangle src/util.jl :eval no :hidden
end
#+END_SRC
** Operator
#+BEGIN_SRC jupyter-julia :tangle src/operator.jl :eval no :hidden
module Operators
export AbstractOperator, Operator, exp, +, *, ⊗, nsite_op
#+END_SRC

#+BEGIN_SRC jupyter-julia :tangle src/operator.jl
using TensorOperations
using LinearAlgebra

abstract type AbstractOperator{T<:AbstractArray,N} end

struct Operator{T,N,A<:AbstractArray{T}} <: AbstractOperator{A,N}
    tensor::A
    function Operator(tensor::A) where {T,N2,A<:AbstractArray{T,N2}}
        @assert iseven(N2) "The tensor dimension has to be even! In=Out"
        new{T,Int(N2 / 2),A}(tensor)
    end
end

Base.show(io::IO, S::Operator{T,N,A}) where {T,N,A} =
    print(io, "Operator{$T,$N,$A}: ", repr(size(S.tensor)))

Base.ndims(::Type{<:AbstractOperator{<:Any,N}}) where {N} = N * 2

function Base.exp(op::Operator{T,N}) where {T,N}
    s = size(op.tensor)
    return reshape(exp(reshape(op.tensor, (prod(s[1:N]), prod(s[N+1:2N])))), s) |> Operator
end

function Base.:+(a::Operator{T,N}, b::Operator{T,N}) where {T,N}
    return Operator(a.tensor .+ b.tensor)
end

function Base.:*(a::Number, b::Operator)
    return Operator(a .* b.tensor)
end

if Base.PkgId(Base.UUID("052768ef-5323-5732-b1bb-66c8b64840ba"), "CUDA") ∈
   keys(Base.loaded_modules)
    import LinearAlgebra: Hermitian
    import CUDA: CuArray
    function Base.exp(A::Operator{T,N,Arr}) where {T,N,Arr<:CuArray}
        s = size(A.tensor)
        F = eigen(Hermitian(reshape(A.tensor, (prod(s[1:N]), prod(s[N+1:2N])))))
        retmat = (F.vectors * Diagonal(exp.(F.values))) * F.vectors'
        retmat -= Diagonal(imag(diag(retmat)) * im)
        return Operator(reshape(retmat, s))
    end
end

⊗(a::AbstractArray{T1,2}, b::AbstractArray{T2,2}) where {T1,T2} =
    @tensor c[i, j, k, l] := a[i, k] * b[j, l]

@generated function ⊗(xs::Vararg{AbstractArray,N}) where {N}
    dims = Int.(ndims.(xs) ./ 2)
    half_inds = sum(dims)
    indsleft = Vector{Int}[]
    indsright = Vector{Int}[]
    c = 1
    for dim in dims
        iis = -1 * (c:c+(dim-1))
        push!(indsleft, iis)
        push!(indsright, iis .- half_inds)
        c += dim
    end
    rightside = Expr(
        :call,
        :*,
        (:(xs[$i][$((indsleft[i]..., indsright[i]...)...)]) for i = 1:length(dims))...,
    )
    return :(@tensor _[:] := $rightside)
end
⊗(x::AbstractArray) = x

⊗(os::Vararg{Operator,N}) where {N} = ⊗(getproperty.(os, :tensor))

function nsite_op(op::Operator{T}, inds, dims) where {T}
    N = length(dims)
    op_left = inds |> collect
    op_right = op_left .+ N
    I_left = deleteat!(1:N |> collect, op_left)
    I_right = I_left .+ N
    I_op = ⊗(
        [
            UniformScaling{T}(one(T))(d) |> collect for
            (i, d) in enumerate(dims) if i ∉ inds
        ]...,
    )
    Operator(ncon((op.tensor, I_op), ([op_left; op_right] .* -1, [I_left; I_right] .* -1)))
end
#+END_SRC

#+BEGIN_SRC jupyter-julia :tangle src/operator.jl :eval no :hidden
end
#+END_SRC
